In [1]:
import pandas as pd

In [12]:
df = pd.read_csv("train.csv")
df

  Unnamed: 0  train no   ID Name   aa   we we.1
0          a         0  123  all    s  sds    s
1          b         1   45   ka  NaN  sds   sd
2          c         2   32   we   sd  sds  NaN

In [13]:
df.dropna()

  Unnamed: 0  train no   ID Name aa   we we.1
0          a         0  123  all  s  sds    s

In [14]:
df.dropna(axis=1)

  Unnamed: 0  train no   ID Name   we
0          a         0  123  all  sds
1          b         1   45   ka  sds
2          c         2   32   we  sds

In [15]:
df.dropna(how='any')

  Unnamed: 0  train no   ID Name aa   we we.1
0          a         0  123  all  s  sds    s

In [18]:
df.dropna(how='all')

  Unnamed: 0  train no   ID Name   aa   we we.1
0          a         0  123  all    s  sds    s
1          b         1   45   ka  NaN  sds   sd
2          c         2   32   we   sd  sds  NaN

# threshold

In [20]:
df.dropna(thresh=1)

  Unnamed: 0  train no   ID Name   aa   we we.1
0          a         0  123  all    s  sds    s
1          b         1   45   ka  NaN  sds   sd
2          c         2   32   we   sd  sds  NaN

In [22]:
df.dropna(subset=["we.1"])

  Unnamed: 0  train no   ID Name   aa   we we.1
0          a         0  123  all    s  sds    s
1          b         1   45   ka  NaN  sds   sd

In [ ]:
df.dropna(inplace=)